<?php
return [
	'100000'=>'请输入正确的图形验证码',
	'100001'=>'__REPLACE__',//验证类验证
	'100002'=>'登录名或者密码错误',//用户名错误
	'100003'=>'当前用户处于非正常状态',
	'100004'=>'登录名或者密码错误',//密码错误

	'100100'=>'旧手机号码不能为空',
	'100101'=>'请输入正确的旧手机号码',
	'100102'=>'输入的旧手机号不匹配',
	'100103'=>'验证码发送失败请刷新后重试',

	'100200'=>'旧手机号码不能为空',
	'100201'=>'请输入正确的旧手机号码',
	'100202'=>'手机验证码不能为空',
	'100203'=>'新手机号码不能为空',
	'100204'=>'请输入正确的新手机号码',
	'100205'=>'输入的旧手机号不匹配',
	'100206'=>'验证码不正确',
	'100207'=>'验证码已过期',
	'100208'=>'修改手机号失败',

	'100300'=>'旧密码不能为空',
	'100301'=>'旧密码长度不能低于6位',
	'100302'=>'新密码不能为空',
	'100303'=>'新密码长度不能低于6位',
	'100304'=>'再次新密码不能为空',
	'100305'=>'再次新密码长度不能低于6位',
	'100306'=>'新旧密码不能一样',
	'100307'=>'新密码两次输入不一样',
	'100308'=>'旧密码错误请重新输入',
	'100309'=>'修改密码失败',

	'100400'=>'不存在你所需改的分类',
	'100401'=>'当前已经是推荐状态',
	'100402'=>'推荐失败',

	'100500'=>'不存在你所需改的分类',
	'100501'=>'当前不是推荐状态无需取消',
	'100502'=>'取消推荐失败',

	'100600'=>'不存在你所需改的商品',
	'100601'=>'当前已经是推荐状态',
	'100602'=>'推荐失败',

	'100700'=>'不存在你所需改的商品',
	'100701'=>'当前不是推荐状态无需取消',
	'100702'=>'取消推荐失败',

	//index/version
	'100800'=>'发布新版本错误，__REPLACE__',
	'100801'=>'发布新版本失败',
	'100802'=>'获取版本信息失败',
	'100803'=>'修改版本错误，__REPLACE__',
	'100804'=>'所修改版本不存在',
	'100805'=>'修改版本失败',

	'100900'=>'所需修改的商品不存在，请刷新后再操作',
	'100901'=>'当前操作非法，请刷新后再操作',
	'100902'=>'__REPLACE__失败',

	'101000'=>'请选择供应商',
	'101001'=>'最少选择一种分类',
	'101002'=>'商品名称不能为空',
	'101003'=>'商品规格组合不能为空',
	'101004'=>'商品主图不能为空',
	'101005'=>'__REPLACE__',
	'101006'=>'开启定制请输入定制价格',
	'101007'=>'开启定制请选择定制单位',
	'101008'=>'当前操作非法，请刷新后再操作',
	'101009'=>'添加商品失败,编号：__REPLACE__',
	'101010'=>'请为添加的分类选上所属类目',

	'101100'=>'删除图片失败',

	'101200'=>'请选择供应商',
	'101201'=>'商品名称不能为空',
	'101202'=>'开启定制请输入定制价格',
	'101203'=>'开启定制请选择定制单位',
	'101204'=>'商品规格组合不能为空',
	'101205'=>'请为修改的分类选上所属类目',
	'101206'=>'请为添加的分类选上所属类目',
	'101207'=>'规格组合有误：__REPLACE__',
	'101208'=>'商品主图不能为空',
	'101209'=>'当前操作非法，请刷新后再操作',
	'101210'=>'新增的分类已经存在不能再添加',
	'101211'=>'修改错误：__REPLACE__',
	'101212'=>'当前修改的分类已经存在',
];