<?php
return [
	'100000'=>'请输入正确的图形验证码',
	'100001'=>'__REPLACE__',//验证类验证
	'100002'=>'登录名或者密码错误',//用户名错误
	'100003'=>'当前用户处于非正常状态',
	'100004'=>'登录名或者密码错误',//密码错误

	'100100'=>'旧手机号码不能为空',
	'100101'=>'请输入正确的旧手机号码',
	'100102'=>'输入的旧手机号不匹配',
	'100103'=>'验证码发送失败请刷新后重试',

	'100200'=>'旧手机号码不能为空',
	'100201'=>'请输入正确的旧手机号码',
	'100202'=>'手机验证码不能为空',
	'100203'=>'新手机号码不能为空',
	'100204'=>'请输入正确的新手机号码',
	'100205'=>'输入的旧手机号不匹配',
	'100206'=>'验证码不正确',
	'100207'=>'验证码已过期',
	'100208'=>'修改手机号失败',

	'100300'=>'旧密码不能为空',
	'100301'=>'旧密码长度不能低于6位',
	'100302'=>'新密码不能为空',
	'100303'=>'新密码长度不能低于6位',
	'100304'=>'再次新密码不能为空',
	'100305'=>'再次新密码长度不能低于6位',
	'100306'=>'新旧密码不能一样',
	'100307'=>'新密码两次输入不一样',
	'100308'=>'旧密码错误请重新输入',
	'100309'=>'修改密码失败',

	'100400'=>'不存在你所需改的分类',
	'100401'=>'当前已经是推荐状态',
	'100402'=>'推荐失败',

	'100500'=>'不存在你所需改的分类',
	'100501'=>'当前不是推荐状态无需取消',
	'100502'=>'取消推荐失败',

	'100600'=>'不存在你所需改的商品',
	'100601'=>'当前已经是推荐状态',
	'100602'=>'推荐失败',

	'100700'=>'不存在你所需改的商品',
	'100701'=>'当前不是推荐状态无需取消',
	'100702'=>'取消推荐失败',
];